# 데이터 재구조화

In [1]:
# Melt = 행 중심 형태로 길게 재구조화하는 변환

from hossam import load_data
from pandas import pivot_table, melt

### 피벗 테이블

In [3]:
origin = load_data('city_people')
origin

[data] https://data.hossam.kr/data/lab05/city_people.xlsx
[desc] 서울, 인천, 부산에서 2005년, 2010년 2015년에 조사한 가상의 인구수 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [5]:
pivot1 = pivot_table(origin,
                     index = '도시',
                     columns = '연도',
                     values = '인구'
)
print(type(pivot1))
pivot1

<class 'pandas.core.frame.DataFrame'>

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

In [7]:
# 중복데이터 집계 방법 지정하기
# 인덱스와 컬럼에 따른 value가 2개 이상일 때 -> aggfunc 지정

pivot_table(origin,
            index = '지역',
            columns = '연도',
            values = '인구',
            aggfunc = 'sum'
)

연도      2005      2010      2015
지역
경상권  3512547   3393191   3448737
수도권  9762546  12263517  12794763

In [9]:
# 두 개 이상 집계 함수 지정

pivot_table(origin,
            index ='지역',
            columns = '연도',
            values = '인구',
            aggfunc = ['sum','mean']
)

         sum                           mean
연도      2005      2010      2015       2005       2010       2015
지역
경상권  3512547   3393191   3448737  3512547.0  3393191.0  3448737.0
수도권  9762546  12263517  12794763  9762546.0  6131758.5  6397381.5

In [15]:
# 복수 인덱스 지정

pivot_table(origin,
            index = ['지역', '연도'],
            columns ='도시',
            values = '인구',
            aggfunc = ['sum', 'mean']
)

                sum                             mean
도시               부산         서울         인천         부산         서울         인천
지역  연도
경상권 2005  3512547.0        NaN        NaN  3512547.0        NaN        NaN
    2010  3393191.0        NaN        NaN  3393191.0        NaN        NaN
    2015  3448737.0        NaN        NaN  3448737.0        NaN        NaN
수도권 2005        NaN  9762546.0        NaN        NaN  9762546.0        NaN
    2010        NaN  9631482.0  2632035.0        NaN  9631482.0  2632035.0
    2015        NaN  9904312.0  2890451.0        NaN  9904312.0  2890451.0

### Melt

In [18]:
pivot = pivot_table(origin,
                    index = '연도',
                    columns = '지역',
                    values = '인구',
                    aggfunc = 'mean')
pivot

지역          경상권        수도권
연도
2005  3512547.0  9762546.0
2010  3393191.0  6131758.5
2015  3448737.0  6397381.5

In [21]:
# 데이터 프레임 인덱스를 일반 컬럼으로 설정
pivot2 = pivot.reset_index()
pivot2

지역    연도        경상권        수도권
0   2005  3512547.0  9762546.0
1   2010  3393191.0  6131758.5
2   2015  3448737.0  6397381.5

In [22]:
# 피벗 테이블에 대한 melt 처리

mdf = melt(pivot2, id_vars = ['연도'],
                    value_vars = ['경상권', '수도권'])
mdf

     연도   지역      value
0  2005  경상권  3512547.0
1  2010  경상권  3393191.0
2  2015  경상권  3448737.0
3  2005  수도권  9762546.0
4  2010  수도권  6131758.5
5  2015  수도권  6397381.5

In [23]:
# 이름 지정

mdf = melt(pivot2, id_vars = ['연도'],
           value_vars = ['경상권', '수도권'],
           var_name = '구분', value_name = '인구수')
mdf

     연도   구분        인구수
0  2005  경상권  3512547.0
1  2010  경상권  3393191.0
2  2015  경상권  3448737.0
3  2005  수도권  9762546.0
4  2010  수도권  6131758.5
5  2015  수도권  6397381.5

### 연습문제

In [25]:
origin = load_data('students_smoke')
origin

[data] https://data.hossam.kr/data/lab05/students_smoke.xlsx
[desc] 한 도시의 20개 중,고교를 대상으로 조사한 흡연율 자료 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    지역  구성   흡연율
0   도시   남  0.64
1   도시   여  0.45
2   농촌  공학  0.70
3   도시   남  0.85
4   농촌   남  0.72
5   도시   남  0.78
6   도시   여  0.62
7   도시   남  0.79
8   농촌   남  0.75
9   농촌  공학  0.81
10  농촌   여  0.56
11  도시   여  0.48
12  농촌   남  0.72
13  도시  공학  0.68
14  농촌   남  0.79
15  도시   남  0.90
16  농촌   여  0.34
17  도시   여  0.48
18  농촌   여  0.49
19  농촌  공학  0.76

In [67]:
df1 = pivot_table(origin,
                  index = '지역',
                  columns = '구성',            
                  values = '흡연율',
                  aggfunc = 'mean'
)
df1

구성        공학      남         여
지역
농촌  0.756667  0.745  0.463333
도시  0.680000  0.792  0.507500

In [48]:
df2 = load_data('icecream_sales')
df2

[data] https://data.hossam.kr/data/lab05/icecream_sales.xlsx
[desc] '달콤 스쿱' 아이스크림 가게의 매출 데이터 (인덱스 없음)

field     description
--------  -------------
Date      판매 날짜
Flavor    아이스크림 맛
Topping   추가된 토핑
Price     개당 가격
Quantity  판매 수량

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
5  2023-07-02    바닐라     NaN   3000      30.0
6  2023-07-03     딸기      연유   3200      25.0
7  2023-07-03   민트초코     초코칩   3800       NaN
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [ ]:
print(df2.info())
rows, cols = df2.shape
print('%d행, %d열, %d차원 데이터' % (rows, cols, df2.ndim))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      12 non-null     bool
 1   Flavor    12 non-null     bool
 2   Topping   12 non-null     bool
 3   Price     12 non-null     bool
 4   Quantity  12 non-null     bool
dtypes: bool(5)
memory usage: 192.0 bytes
None
12행, 5열, 2차원 데이터

In [73]:
na1 = df2.dropna(subset =['Quantity']) 
na1

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
5  2023-07-02    바닐라     NaN   3000      30.0
6  2023-07-03     딸기      연유   3200      25.0
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [74]:
pivot1 = pivot_table(na1,
                 index = 'Date',
                 columns = 'Flavor',
                 values = 'Quantity',
                 
)
pivot1

Flavor        딸기  민트초코   바닐라   초콜릿
Date
2023-07-01  18.0   NaN  25.0  20.0
2023-07-02   NaN  15.0  30.0  22.0
2023-07-03  25.0   NaN  28.0   NaN
2023-07-04  22.0  17.0   NaN  18.0

In [62]:
pivot2 = pivot1.reset_index()
pivot2

Flavor       Date    딸기  민트초코   바닐라   초콜릿
0      2023-07-01  18.0   NaN  25.0  20.0
1      2023-07-02   NaN  15.0   NaN  22.0
2      2023-07-03  25.0   NaN  28.0   NaN
3      2023-07-04  22.0  17.0   NaN  18.0

In [79]:
# 피벗 테이블에 대한 melt 처리

mdf = melt(pivot2, id_vars = ['Date'],
                    value_vars = ['딸기','민트초코','바닐라','초콜릿'],
                    var_name = 'flavor',
                    value_name = 'Quantity')
mdf

         Date flavor  Quantity
0  2023-07-01     딸기      18.0
1  2023-07-02     딸기       NaN
2  2023-07-03     딸기      25.0
3  2023-07-04     딸기      22.0
4  2023-07-01   민트초코       NaN
5  2023-07-02   민트초코      15.0
6  2023-07-03   민트초코       NaN
7  2023-07-04   민트초코      17.0
8  2023-07-01    바닐라      25.0
9  2023-07-02    바닐라       NaN
10 2023-07-03    바닐라      28.0
11 2023-07-04    바닐라       NaN
12 2023-07-01    초콜릿      20.0
13 2023-07-02    초콜릿      22.0
14 2023-07-03    초콜릿       NaN
15 2023-07-04    초콜릿      18.0

In [80]:
re_mdf = mdf.copy()
re_mdf = mdf.dropna(subset =['Quantity'])
re_mdf

         Date flavor  Quantity
0  2023-07-01     딸기      18.0
2  2023-07-03     딸기      25.0
3  2023-07-04     딸기      22.0
5  2023-07-02   민트초코      15.0
7  2023-07-04   민트초코      17.0
8  2023-07-01    바닐라      25.0
10 2023-07-03    바닐라      28.0
12 2023-07-01    초콜릿      20.0
13 2023-07-02    초콜릿      22.0
15 2023-07-04    초콜릿      18.0

In [81]:
re_mdf1 = re_mdf.reset_index()
re_mdf1

   index       Date flavor  Quantity
0      0 2023-07-01     딸기      18.0
1      2 2023-07-03     딸기      25.0
2      3 2023-07-04     딸기      22.0
3      5 2023-07-02   민트초코      15.0
4      7 2023-07-04   민트초코      17.0
5      8 2023-07-01    바닐라      25.0
6     10 2023-07-03    바닐라      28.0
7     12 2023-07-01    초콜릿      20.0
8     13 2023-07-02    초콜릿      22.0
9     15 2023-07-04    초콜릿      18.0